## Тип 12 № [36867](https://inf-ege.sdamgia.ru/problem?id=36867)

Известно, что исходная строка начиналась с нуля и заканчивалась нулём, а между ними содержала только единицы, двойки и тройки.

После выполнения данной программы получилась строка, содержащая 26 единиц, 54 двойки и 48 троек. 

Сколько цифр было в исходной строке?


```python
lst = ('1' * x + '2' * y + '3' * z for x in range(20) for y in range(20) for z in range(20))


while True:
    s0 = next(lst)
    s = '0' + s0 + '0'
    while '00' not in s:
        s = s.replace('01', '210', 1)
        s = s.replace('02', '320', 1)
        s = s.replace('03', '3012', 1)
    if s.count('1') == 26 and s.count('2') == 56 and s.count('3') == 48:
        print(len(s0)-2)
        break
```