
## Задача 48 Тип 26 [№ 559704](https://inf-ege.sdamgia.ru/problem?id=59704)

Входной файл содержит сведения о заявках на проведение занятий в конференц-зале.

В каждой заявке указаны время начала и время окончания мероприятия (в минутах от начала суток).

Если время начала одного мероприятия меньше времени окончания другого, то провести можно только одно из них.

Если время окончания одного мероприятия совпадает с временем начала другого, то провести можно оба.

Определите максимальное количество мероприятий, которое можно провести в конференц-зале и самое позднее время окончания последнего мероприятия.


Входные данные

В первой строке входного файла находится натуральное число N (N < 1000)  — количество заявок на проведение мероприятий.

Следующие N строк содержат пары чисел, обозначающих время начала и время окончания мероприятий. Каждое из чисел натуральное, не превосходящее 1440.

Запишите в ответе два числа: максимальное  — количество мероприятий, которое можно провести в конференц-зале и самое позднее время окончания последнего мероприятия (в минутах от начала суток).

Типовой пример организации данных во входном файле

```
5
10 150
100 110
131 170
131 180
120 130
```
При таких исходных данных можно провести максимум три мероприятия, например, по заявкам 2, 3 и 5.

Конференц-зал освободится самое позднее на 180-й минуте, если состоятся мероприятия по заявкам 2, 4, 5.

Типовой пример имеет иллюстративный  — характер. Для выполнения задания используйте данные из прилагаемых файлов.


### Решение


```python
f = open('txt1.txt')
N = int(f.readline())
lst = [list(map(int, date.split())) for date in f if date.split()]
lst.sort(key=lambda x: x[1])

res = [lst.pop(0)]

i = 0
while i < len(lst):
    t = lst[i]
    if t[0] >= res[-1][1]:
        res.append(t)
    i += 1

# [989, 991], [994, 1028]]
# 992 1345

for i in range(1, len(lst)):
    if lst[i][0] <= res[-1][0] and lst[i][0] >= res[-2][1]:
        res[-1] = lst[i]


print(len(res), res[-1][1], res[-1], res[-2])
```

