
## Задача 14 Тип 27 [№ 33199](https://inf-ege.sdamgia.ru/problem?id=33199)

Набор данных состоит из троек натуральных чисел.

Необходимо распределить все числа на три группы, при этом в каждую группу должно попасть ровно одно число из каждой исходной тройки.

Сумма всех чисел в первой группе должна быть чётной, во второй — нечётной.

Определите максимально возможную сумму всех чисел в третьей группе.

### Входные данные.

[Файл A](27-A.txt)

[Файл Б](27-B.txt)



Первая строка входного файла содержит число N общее количество троек в наборе.

Каждая из следующих N строк содержит три натуральных числа, не превышающих 10 000.

### Пример входного файла:
```
3
1 2 3
5 12 4
6 9 7
```

Для указанных данных искомая сумма равна 24, она соответствует такому распределению чисел по группам: (1,5,6), (2,4,7), (3,12,9).

Вам даны два входных файла (A и B), каждый из которых имеет описанную выше структуру. В ответе укажите два числа: сначала значение искомой суммы для файла A, затем для файла B.


### Решение


```python
f = open('27-B.txt')
N = f.readline()

sum_1 = sum_2 = sum_3 = 0
mindiverens = []
for data in f:
    data = sorted(map(int, data.split()))
    diverens = min(data[2] - data[1], data[2] - data[1])
    if diverens != 0 and diverens not in mindiverens:
        mindiverens.append(diverens)
    sum_1 += data[0]
    sum_2 += data[1]
    sum_3 += data[2]

mindiverens.sort()


if sum_1 % 2 == sum_2 % 2:
    sum_3 -= mindiverens[0]
print(sum_3)
```


В результате работы данного алгоритма при вводе данных

из файла A
```
541
```
из файла B
```
300229428
```