
## Задача 38 Тип 26 [№ 55822](https://inf-ege.sdamgia.ru/problem?id=55822)

В аэропорту есть камера хранения из K ячеек, которые пронумерованы с 1.

Принимаемый багаж кладется в свободную ячейку с минимальным номером.

Известно время, когда пассажиры сдают и забирают багаж (в минутах с начала суток).

Ячейка доступна для багажа, начиная со следующей минуты, после окончания срока хранения.

Если свободных ячеек не находится, то багаж не принимается в камеру хранения.

Найдите количество багажей, которое будет сдано в камеры за 24 часа и номер ячейки, в которую сдаст багаж последний пассажир.

### Входные данные

В первой строке входного файла находится число K  — количество ячеек в камере хранения, во второй строке файла число N  — количество пассажиров, сдающих багаж (натуральное число, не превышающее 1000).

Каждая из следующих N строк содержит два натуральных числа, не превышающих 1440: время сдачи багажа и время выдачи багажа.

[Файл](https://inf-ege.sdamgia.ru/get_file?id=130185)

#### Выходные данные

Программа должна вывести два числа: количество сданных в камеру хранения багажей и номер ячейки, в которую примут багаж у последнего пассажира, который сможет сдать багаж.

Типовой пример организации данных:
```
2
4
30 1000
60 100
61 1100
1010 1440
```
Для указанного примера багаж смогут сдать первый, второй и четвёртый пассажир.

Последний пассажир сдаст свой багаж в ячейку один, так как к этому моменту первая и вторая ячейка будут свободны.



### Решение


```python
f = open('txt1.txt')

k = int(f.readline())  # 210 ячейки
n = int(f.readline())  # 987 кол-во пассажиров

all_bagage = []

for val in f:
    t1, t2 = map(int, val.split())
    all_bagage.append([t1, t2])

all_bagage.sort(key=lambda x: x[0])

camera = all_bagage[:k]
all_bagage = all_bagage[k:]
print(camera)
print(all_bagage)

count = k
while len(all_bagage) > 0:
    i = 0
    bagage = all_bagage.pop(0)
    while i < k:
        if bagage[0] > camera[i][1] and bagage[1] < 1440:
            camera[i] = bagage
            count += 1
            num = i
            break
        i += 1

print(count, num + 1)
print(len(camera))

```

