
## Задача 43 Тип 26 [№ 56526](https://inf-ege.sdamgia.ru/problem?id=56554)

При проведении эксперимента заряженные частицы попадают на чувствительный экран, представляющий из себя матрицу размером 100 000 на 100 000 точек.

При попадании каждой частицы на экран в протоколе фиксируются координаты попадания: номер ряда (целое число от 1 до 100 000) и номер позиции в ряду (целое число от 1 до 100 000).


Точка экрана, в которую попала хотя бы одна частица, считается светлой, точка, в которую ни одна частица не попала,  — тёмной.


При анализе результатов эксперимента рассматривают линии. Линией называют группу точек, расположенных в одном ряду подряд.

Линия начинается и заканчивается светлыми точками, между которыми могут располагаться как светлые, так и тёмные точки, но не более семи тёмных точек подряд.

Вам необходимо по заданному протоколу определить наибольшее общее количество светлых и тёмных точек в одной линии и номер ряда, в котором это количество встречается.

 Если таких рядов несколько, укажите максимально возможный номер.



### Решение


```python
import re

f = open('26.txt')
N = int(f.readline())

S = {i: set() for i in range(1, 10 ** 5 + 1)}

for line in f:
    x, y = map(int, line.split())
    S[x].add(y)


tmpl = '\\*{3,}'
l_max = 0
for key, line in S.items():
    if len(line) > 5:
        line = sorted(line)
        total = 0
        st = '*'
        for i in range(len(line) - 1):
            if line[i] == line[i + 1] - 1:
                st += '*'
            else:
                st += ' *'
        c = len(re.findall(tmpl, st))
        if c >= l_max:
            print(st, c, key)
            l_max = c
            x = key

print(l_max, x)

```

### Подумать над способом без регулярки