### [№ 55823](https://inf-ege.sdamgia.ru/problem?id=55823)



Метеорологическая станция ведёт наблюдение за количеством выпавших осадков. 

Показания записываются каждую минуту в течение N минут.

Определяется пара измерений, между которыми прошло не менее `K` минут.

Найдите максимальную сумму показаний среди таких пар.


### [Файл А](27A.txt)
### [Файл B](27B.txt)

Входные данные.

Даны два входных файла (A и B), каждый из которых в первой строке содержит число N  — количество измерений, во второй строке K  — минимальное количество минут между искомыми измерениями. 

В каждой из следующих N строк находится число: количество выпавших осадков.

В ответе укажите два числа: сначала значение искомой величины для файла A, затем  — для файла B.

в лоб!!

```python
f = open('39-метеостанция/27B.txt')
print(f.readline())

s = [int(i) for i in f]
s1 = sorted(s,reverse=True)

# print(s1[:10])

for x in s1[:10]: 
  print(x, s.count(x))


print(sum(s1[:2]))
```


```python
f = open('39-метеостанция/27B.txt')
N = int(f.readline())
K = int(f.readline())
a = [int(x) for x in f]
m = 0
maxi = 0

for i in range(N - K):  
    m = max(m, a[i + K])
    maxi = max(maxi, a[i] + m)  
print(maxi)
```