
## Задача 19 Тип 27 [№ 36001](https://inf-ege.sdamgia.ru/problem?id=36001)

В текстовом файле записан набор пар натуральных чисел, не превышающих 10 000. Необходимо выбрать из набора некоторые пары так, чтобы первое число в каждой выбранной паре было нечётным, сумма бо́льших чисел во всех выбранных парах была нечётной, а сумма меньших  — чётной. Какую наибольшую сумму чисел во всех выбранных парах можно при этом получить?
Входные данные.

[Файл A](https://inf-ege.sdamgia.ru/get_file?id=89423)
[Файл B](https://inf-ege.sdamgia.ru/get_file?id=89424)

Первая строка входного файла содержит целое число N  — общее количество пар в наборе. Каждая из следующих N строк содержит пару чисел.

Пример входного файла:
```
4
5 2
8 15
7 14
```
11 9 В данном случае есть три подходящие пары: (5, 2), (7, 14) и (11, 9). Пара (8, 15) не подходит, так как в ней первое число чётное. Чтобы удовлетворить требования, надо взять пары (7, 14) и (11, 9). Сумма бо́льших чисел в этом случае равна 25, сумма меньших равна 16. Общая сумма равна 41. В ответе надо указать число 41.

Вам даны два входных файла (A и B), каждый из которых имеет описанную выше структуру. В ответе укажите два числа: сначала значение искомой суммы для файла A, затем для файла B.


### Решение


```python
lst = '''
4
5
8
14
11
'''.strip().split('\n')
lst = [int(x) for x in lst]
lst.sort()
print(lst)
b_0 = [i for i in lst if i % 3 == 0][:3]
b_1 = [i for i in lst if i % 3 == 1][:3]
b_2 = [i for i in lst if i % 3 == 2][:3]

print(b_0, b_1, b_2)

res = 10 ** 10

if len(b_0) > 2:
    res = min(res, sum(b_0[:3]))   
if len(b_1) > 2:
    res = min(res, sum(b_1[:3]))
if len(b_2) > 2:
    res = min(res, sum(b_2[:3])) 

if b_0 and b_1 and b_2:
    res = min(res, min(b_0), min(b_1), min(b_2))

print(res)
```


